<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"azurerm","backend":"50e0639345ecd43a7f956ae861cf7fd8cf514b407b128b31ffc5c5733c3cc923","plan_job_ref":"Job ci cd #112 at https://github.com/HossainAhnaf/terraform/actions/runs/16461395114","plan_out_hash":"f2339fdef5d710171e1ff3afa2faa0050fe9edb972d7d41fd8f79f69844e091a","plan_hash":"1216da3b03b53506207c55142ecdae9972b367ad5c8e87ca69d76f607013afe7","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __.__ in the __dev__ workspace
With var files: `dev.tfvars`
<details>
<summary>Plan: 18 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "centralus"
+       name     = "rg-spring-react-devops-dev-centralus"
    }

  # azurerm_virtual_network.main will be created
+   resource "azurerm_virtual_network" "main" {
+       address_space                  = [
+           "10.0.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "centralus"
+       name                           = "vnet-spring-react-devops-dev-centralus"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-spring-react-devops-dev-centralus"
+       subnet                         = (known after apply)
    }

  # module.backend.azurerm_app_service_virtual_network_swift_connection.backend will be created
+   resource "azurerm_app_service_virtual_network_swift_connection" "backend" {
+       app_service_id = (known after apply)
+       id             = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.backend.azurerm_subnet.backend_subnet will be created
+   resource "azurerm_subnet" "backend_subnet" {
+       address_prefixes                              = [
+           "10.0.2.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "snet-spring-react-devops-dev-centralus"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-spring-react-devops-dev-centralus"
+       virtual_network_name                          = "vnet-spring-react-devops-dev-centralus"

+       delegation {
+           name = "appServiceDelegation"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.database.azurerm_mysql_flexible_database.main will be created
+   resource "azurerm_mysql_flexible_database" "main" {
+       charset             = "utf8mb4"
+       collation           = "utf8mb4_unicode_ci"
+       id                  = (known after apply)
+       name                = "mysqldb-spring-react-devops-dev-centralus"
+       resource_group_name = "rg-spring-react-devops-dev-centralus"
+       server_name         = "mysql-spring-react-devops-dev-centralus"
    }

  # module.database.azurerm_mysql_flexible_server.main will be created
+   resource "azurerm_mysql_flexible_server" "main" {
+       administrator_login           = "mysqladmin"
+       administrator_password        = (sensitive value)
+       administrator_password_wo     = (write-only attribute)
+       backup_retention_days         = 7
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = true
+       id                            = (known after apply)
+       location                      = "centralus"
+       name                          = "mysql-spring-react-devops-dev-centralus"
+       private_dns_zone_id           = (known after apply)
+       public_network_access         = "Disabled"
+       public_network_access_enabled = (known after apply)
+       replica_capacity              = (known after apply)
+       replication_role              = (known after apply)
+       resource_group_name           = "rg-spring-react-devops-dev-centralus"
+       sku_name                      = "B_Standard_B1ms"
+       version                       = "8.0.21"
+       zone                          = (known after apply)

+       storage (known after apply)
    }

  # module.database.azurerm_private_dns_zone.server will be created
+   resource "azurerm_private_dns_zone" "server" {
+       id                                                    = (known after apply)
+       max_number_of_record_sets                             = (known after apply)
+       max_number_of_virtual_network_links                   = (known after apply)
+       max_number_of_virtual_network_links_with_registration = (known after apply)
+       name                                                  = "pdns-spring-react-devops-dev-centralus"
+       number_of_record_sets                                 = (known after apply)
+       resource_group_name                                   = "rg-spring-react-devops-dev-centralus"

+       soa_record (known after apply)
    }

  # module.database.azurerm_private_dns_zone_virtual_network_link.server will be created
+   resource "azurerm_private_dns_zone_virtual_network_link" "server" {
+       id                    = (known after apply)
+       name                  = "pls-spring-react-devops-dev-centralus"
+       private_dns_zone_name = "pdns-spring-react-devops-dev-centralus"
+       registration_enabled  = false
+       resource_group_name   = "rg-spring-react-devops-dev-centralus"
+       virtual_network_id    = (known after apply)
    }

  # module.database.azurerm_private_endpoint.mysql_pe will be created
+   resource "azurerm_private_endpoint" "mysql_pe" {
+       custom_dns_configs       = (known after apply)
+       id                       = (known after apply)
+       location                 = "centralus"
+       name                     = "pe-spring-react-devops-dev-centralus"
+       network_interface        = (known after apply)
+       private_dns_zone_configs = (known after apply)
+       resource_group_name      = "rg-spring-react-devops-dev-centralus"
+       subnet_id                = (known after apply)

+       private_dns_zone_group {
+           id                   = (known after apply)
+           name                 = "pdnszg-spring-react-devops-dev-centralus"
+           private_dns_zone_ids = (known after apply)
        }

+       private_service_connection {
+           is_manual_connection           = false
+           name                           = "psc-spring-react-devops-dev-centralus"
+           private_connection_resource_id = (known after apply)
+           private_ip_address             = (known after apply)
+           subresource_names              = [
+               "mysqlServer",
            ]
        }
    }

  # module.database.azurerm_subnet.server_subnet will be created
+   resource "azurerm_subnet" "server_subnet" {
+       address_prefixes                              = [
+           "10.0.1.0/24",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = "snet-spring-react-devops-dev-centralus"
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-spring-react-devops-dev-centralus"
+       virtual_network_name                          = "vnet-spring-react-devops-dev-centralus"
    }

  # module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend.module.avm-res-web-serverfarm.data.azurerm_location.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_location" "region" {
+       display_name  = (known after apply)
+       id            = (known after apply)
+       location      = "centralus"
+       zone_mappings = (known after apply)
    }

  # module.backend.module.avm-res-web-serverfarm.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "centralus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "plan-spring-react-devops-dev-centralus"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-spring-react-devops-dev-centralus"
+       sku_name                        = "B1"
+       worker_count                    = 1
+       zone_balancing_enabled          = false
    }

  # module.backend.module.avm-res-web-site.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "centralus"
+       name                                = "ai-app-spring-react-devops-dev-centralus"
+       resource_group_name                 = "rg-spring-react-devops-dev-centralus"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.backend.module.avm-res-web-site.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "app-spring-react-devops-dev-centralus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-spring-react-devops-dev-centralus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-backend:latest"
+               docker_registry_url = "https://ghcr.io/hossainahnaf"
            }
        }
    }

  # module.frontend.module.avm-res-web-serverfarm.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "centralus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "plan-spring-react-devops-dev-centralus"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-spring-react-devops-dev-centralus"
+       sku_name                        = "B1"
+       worker_count                    = 1
+       zone_balancing_enabled          = false
    }

  # module.frontend.module.avm-res-web-site.azurerm_application_insights.this[0] will be created
+   resource "azurerm_application_insights" "this" {
+       app_id                              = (known after apply)
+       application_type                    = "web"
+       connection_string                   = (sensitive value)
+       daily_data_cap_in_gb                = 100
+       disable_ip_masking                  = false
+       force_customer_storage_for_profiler = false
+       id                                  = (known after apply)
+       instrumentation_key                 = (sensitive value)
+       internet_ingestion_enabled          = true
+       internet_query_enabled              = true
+       local_authentication_disabled       = false
+       location                            = "centralus"
+       name                                = "ai-app-spring-react-devops-dev-centralus"
+       resource_group_name                 = "rg-spring-react-devops-dev-centralus"
+       retention_in_days                   = 90
+       sampling_percentage                 = 100
+       workspace_id                        = (known after apply)
    }

  # module.frontend.module.avm-res-web-site.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "app-spring-react-devops-dev-centralus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-spring-react-devops-dev-centralus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-frontend:latest"
+               docker_registry_url = "https://ghcr.io/hossainahnaf"
            }
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   backend_api_url = "https://app-spring-react-devops-dev-centralus.azurewebsites.net"
+   frontend_url    = "https://app-spring-react-devops-dev-centralus.azurewebsites.net"

Warning: Value for undeclared variable

The root module does not declare a variable named "prefix" but a value was
found in file "zzzz-dflook-terraform-github-actions-00.dev.auto.tfvars". If
you meant to use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [ci cd #112](https://github.com/HossainAhnaf/terraform/actions/runs/16461395114)